GopalSaraf/Practicals/PSDL/include/proc/pic16f527.h
// Register: ADRES
#define ADRES ADRES
extern volatile unsigned char           ADRES               __at(0x00A);
#ifndef _LIB_BUILD
asm("ADRES equ 0Ah");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ADRES                  :8;
    };
    struct {
        unsigned ADRES0                 :1;
        unsigned ADRES1                 :1;
        unsigned ADRES2                 :1;
        unsigned ADRES3                 :1;
        unsigned ADRES4                 :1;
        unsigned ADRES5                 :1;
        unsigned ADRES6                 :1;
        unsigned ADRES7                 :1;
    };
} ADRESbits_t;
extern volatile ADRESbits_t ADRESbits __at(0x00A);
// bitfield macros
#define _ADRES_ADRES_POSN                                   0x0
#define _ADRES_ADRES_POSITION                               0x0
#define _ADRES_ADRES_SIZE                                   0x8
#define _ADRES_ADRES_LENGTH                                 0x8
#define _ADRES_ADRES_MASK                                   0xFF
#define _ADRES_ADRES0_POSN                                  0x0
#define _ADRES_ADRES0_POSITION                              0x0
#define _ADRES_ADRES0_SIZE                                  0x1
#define _ADRES_ADRES0_LENGTH                                0x1
#define _ADRES_ADRES0_MASK                                  0x1
#define _ADRES_ADRES1_POSN                                  0x1
#define _ADRES_ADRES1_POSITION                              0x1
#define _ADRES_ADRES1_SIZE                                  0x1
#define _ADRES_ADRES1_LENGTH                                0x1
#define _ADRES_ADRES1_MASK                                  0x2
#define _ADRES_ADRES2_POSN                                  0x2
#define _ADRES_ADRES2_POSITION                              0x2
#define _ADRES_ADRES2_SIZE                                  0x1
#define _ADRES_ADRES2_LENGTH                                0x1
#define _ADRES_ADRES2_MASK                                  0x4
#define _ADRES_ADRES3_POSN                                  0x3
#define _ADRES_ADRES3_POSITION                              0x3
#define _ADRES_ADRES3_SIZE                                  0x1
#define _ADRES_ADRES3_LENGTH                                0x1
#define _ADRES_ADRES3_MASK                                  0x8
#define _ADRES_ADRES4_POSN                                  0x4
#define _ADRES_ADRES4_POSITION                              0x4
#define _ADRES_ADRES4_SIZE                                  0x1
#define _ADRES_ADRES4_LENGTH                                0x1
#define _ADRES_ADRES4_MASK                                  0x10
#define _ADRES_ADRES5_POSN                                  0x5
#define _ADRES_ADRES5_POSITION                              0x5
#define _ADRES_ADRES5_SIZE                                  0x1
#define _ADRES_ADRES5_LENGTH                                0x1
#define _ADRES_ADRES5_MASK                                  0x20
#define _ADRES_ADRES6_POSN                                  0x6
#define _ADRES_ADRES6_POSITION                              0x6
#define _ADRES_ADRES6_SIZE                                  0x1
#define _ADRES_ADRES6_LENGTH                                0x1
#define _ADRES_ADRES6_MASK                                  0x40
#define _ADRES_ADRES7_POSN                                  0x7
#define _ADRES_ADRES7_POSITION                              0x7
#define _ADRES_ADRES7_SIZE                                  0x1
#define _ADRES_ADRES7_LENGTH                                0x1
#define _ADRES_ADRES7_MASK                                  0x80

// Register: INTCON0
#define INTCON0 INTCON0
extern volatile unsigned char           INTCON0             __at(0x00B);
#ifndef _LIB_BUILD
asm("INTCON0 equ 0Bh");
#endif
// aliases
extern volatile unsigned char           INTCON              __at(0x00B);
#ifndef _LIB_BUILD
asm("INTCON equ 0Bh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned GIE                    :1;
        unsigned                        :3;
        unsigned RAIF                   :1;
        unsigned T0IF                   :1;
        unsigned CWIF                   :1;
        unsigned ADIF                   :1;
    };
} INTCON0bits_t;
extern volatile INTCON0bits_t INTCON0bits __at(0x00B);
// bitfield macros
#define _INTCON0_GIE_POSN                                   0x0
#define _INTCON0_GIE_POSITION                               0x0
#define _INTCON0_GIE_SIZE                                   0x1
#define _INTCON0_GIE_LENGTH                                 0x1
#define _INTCON0_GIE_MASK                                   0x1
#define _INTCON0_RAIF_POSN                                  0x4
#define _INTCON0_RAIF_POSITION                              0x4
#define _INTCON0_RAIF_SIZE                                  0x1
#define _INTCON0_RAIF_LENGTH                                0x1
#define _INTCON0_RAIF_MASK                                  0x10
#define _INTCON0_T0IF_POSN                                  0x5
#define _INTCON0_T0IF_POSITION                              0x5
#define _INTCON0_T0IF_SIZE                                  0x1
#define _INTCON0_T0IF_LENGTH                                0x1
#define _INTCON0_T0IF_MASK                                  0x20
#define _INTCON0_CWIF_POSN                                  0x6
#define _INTCON0_CWIF_POSITION                              0x6
#define _INTCON0_CWIF_SIZE                                  0x1
#define _INTCON0_CWIF_LENGTH                                0x1
#define _INTCON0_CWIF_MASK                                  0x40
#define _INTCON0_ADIF_POSN                                  0x7
#define _INTCON0_ADIF_POSITION                              0x7
#define _INTCON0_ADIF_SIZE                                  0x1
#define _INTCON0_ADIF_LENGTH                                0x1
#define _INTCON0_ADIF_MASK                                  0x80
// alias bitfield definitions
typedef union {
    struct {
        unsigned GIE                    :1;
        unsigned                        :3;
        unsigned RAIF                   :1;
        unsigned T0IF                   :1;
        unsigned CWIF                   :1;
        unsigned ADIF                   :1;
    };
} INTCONbits_t;
extern volatile INTCONbits_t INTCONbits __at(0x00B);
// bitfield macros
#define _INTCON_GIE_POSN                                    0x0
#define _INTCON_GIE_POSITION                                0x0
#define _INTCON_GIE_SIZE                                    0x1
#define _INTCON_GIE_LENGTH                                  0x1
#define _INTCON_GIE_MASK                                    0x1
#define _INTCON_RAIF_POSN                                   0x4
#define _INTCON_RAIF_POSITION                               0x4
#define _INTCON_RAIF_SIZE                                   0x1
#define _INTCON_RAIF_LENGTH                                 0x1
#define _INTCON_RAIF_MASK                                   0x10
#define _INTCON_T0IF_POSN                                   0x5
#define _INTCON_T0IF_POSITION                               0x5
#define _INTCON_T0IF_SIZE                                   0x1
#define _INTCON_T0IF_LENGTH                                 0x1
#define _INTCON_T0IF_MASK                                   0x20
#define _INTCON_CWIF_POSN                                   0x6
#define _INTCON_CWIF_POSITION                               0x6
#define _INTCON_CWIF_SIZE                                   0x1
#define _INTCON_CWIF_LENGTH                                 0x1
#define _INTCON_CWIF_MASK                                   0x40
#define _INTCON_ADIF_POSN                                   0x7
#define _INTCON_ADIF_POSITION                               0x7
#define _INTCON_ADIF_SIZE                                   0x1
#define _INTCON_ADIF_LENGTH                                 0x1
#define _INTCON_ADIF_MASK                                   0x80

// Register: EECON
#define EECON EECON
extern volatile unsigned char           EECON               __at(0x021);
#ifndef _LIB_BUILD
asm("EECON equ 021h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RD                     :1;
        unsigned WR                     :1;
        unsigned WREN                   :1;
        unsigned WRERR                  :1;
        unsigned FREE                   :1;
    };
} EECONbits_t;
extern volatile EECONbits_t EECONbits __at(0x021);
// bitfield macros
#define _EECON_RD_POSN                                      0x0
#define _EECON_RD_POSITION                                  0x0
#define _EECON_RD_SIZE                                      0x1
#define _EECON_RD_LENGTH                                    0x1
#define _EECON_RD_MASK                                      0x1
#define _EECON_WR_POSN                                      0x1
#define _EECON_WR_POSITION                                  0x1
#define _EECON_WR_SIZE                                      0x1
#define _EECON_WR_LENGTH                                    0x1
#define _EECON_WR_MASK                                      0x2
#define _EECON_WREN_POSN                                    0x2
#define _EECON_WREN_POSITION                                0x2
#define _EECON_WREN_SIZE                                    0x1
#define _EECON_WREN_LENGTH                                  0x1
#define _EECON_WREN_MASK                                    0x4
#define _EECON_WRERR_POSN                                   0x3
#define _EECON_WRERR_POSITION                               0x3
#define _EECON_WRERR_SIZE                                   0x1
#define _EECON_WRERR_LENGTH                                 0x1
#define _EECON_WRERR_MASK                                   0x8
#define _EECON_FREE_POSN                                    0x4
#define _EECON_FREE_POSITION                                0x4
#define _EECON_FREE_SIZE                                    0x1
#define _EECON_FREE_LENGTH                                  0x1
#define _EECON_FREE_MASK                                    0x10

// Register: EEDATA
#define EEDATA EEDATA
extern volatile unsigned char           EEDATA              __at(0x025);
#ifndef _LIB_BUILD
asm("EEDATA equ 025h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned EEDATA                 :8;
    };
} EEDATAbits_t;
extern volatile EEDATAbits_t EEDATAbits __at(0x025);
// bitfield macros
#define _EEDATA_EEDATA_POSN                                 0x0
#define _EEDATA_EEDATA_POSITION                             0x0
#define _EEDATA_EEDATA_SIZE                                 0x8
#define _EEDATA_EEDATA_LENGTH                               0x8
#define _EEDATA_EEDATA_MASK                                 0xFF

// Register: EEADR
#define EEADR EEADR
extern volatile unsigned char           EEADR               __at(0x026);
#ifndef _LIB_BUILD
asm("EEADR equ 026h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned EEADR                  :6;
    };
} EEADRbits_t;
