GopalSaraf/Practicals/PSDL/include/proc/pic16f527.h
// Register: INTCON1
#define INTCON1 INTCON1
extern volatile unsigned char           INTCON1             __at(0x065);
#ifndef _LIB_BUILD
asm("INTCON1 equ 065h");
#endif
// aliases
extern volatile unsigned char           INTIE_REG           __at(0x065);
#ifndef _LIB_BUILD
asm("INTIE_REG equ 065h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned WUR                    :1;
        unsigned                        :3;
        unsigned RAIE                   :1;
        unsigned T0IE                   :1;
        unsigned CWIE                   :1;
        unsigned ADIE                   :1;
    };
} INTCON1bits_t;
extern volatile INTCON1bits_t INTCON1bits __at(0x065);
// bitfield macros
#define _INTCON1_WUR_POSN                                   0x0
#define _INTCON1_WUR_POSITION                               0x0
#define _INTCON1_WUR_SIZE                                   0x1
#define _INTCON1_WUR_LENGTH                                 0x1
#define _INTCON1_WUR_MASK                                   0x1
#define _INTCON1_RAIE_POSN                                  0x4
#define _INTCON1_RAIE_POSITION                              0x4
#define _INTCON1_RAIE_SIZE                                  0x1
#define _INTCON1_RAIE_LENGTH                                0x1
#define _INTCON1_RAIE_MASK                                  0x10
#define _INTCON1_T0IE_POSN                                  0x5
#define _INTCON1_T0IE_POSITION                              0x5
#define _INTCON1_T0IE_SIZE                                  0x1
#define _INTCON1_T0IE_LENGTH                                0x1
#define _INTCON1_T0IE_MASK                                  0x20
#define _INTCON1_CWIE_POSN                                  0x6
#define _INTCON1_CWIE_POSITION                              0x6
#define _INTCON1_CWIE_SIZE                                  0x1
#define _INTCON1_CWIE_LENGTH                                0x1
#define _INTCON1_CWIE_MASK                                  0x40
#define _INTCON1_ADIE_POSN                                  0x7
#define _INTCON1_ADIE_POSITION                              0x7
#define _INTCON1_ADIE_SIZE                                  0x1
#define _INTCON1_ADIE_LENGTH                                0x1
#define _INTCON1_ADIE_MASK                                  0x80
// alias bitfield definitions
typedef union {
    struct {
        unsigned WUR                    :1;
        unsigned                        :3;
        unsigned RAIE                   :1;
        unsigned T0IE                   :1;
        unsigned CWIE                   :1;
        unsigned ADIE                   :1;
    };
} INTIE_REGbits_t;
extern volatile INTIE_REGbits_t INTIE_REGbits __at(0x065);
// bitfield macros
#define _INTIE_REG_WUR_POSN                                 0x0
#define _INTIE_REG_WUR_POSITION                             0x0
#define _INTIE_REG_WUR_SIZE                                 0x1
#define _INTIE_REG_WUR_LENGTH                               0x1
#define _INTIE_REG_WUR_MASK                                 0x1
#define _INTIE_REG_RAIE_POSN                                0x4
#define _INTIE_REG_RAIE_POSITION                            0x4
#define _INTIE_REG_RAIE_SIZE                                0x1
#define _INTIE_REG_RAIE_LENGTH                              0x1
#define _INTIE_REG_RAIE_MASK                                0x10
#define _INTIE_REG_T0IE_POSN                                0x5
#define _INTIE_REG_T0IE_POSITION                            0x5
#define _INTIE_REG_T0IE_SIZE                                0x1
#define _INTIE_REG_T0IE_LENGTH                              0x1
#define _INTIE_REG_T0IE_MASK                                0x20
#define _INTIE_REG_CWIE_POSN                                0x6
#define _INTIE_REG_CWIE_POSITION                            0x6
#define _INTIE_REG_CWIE_SIZE                                0x1
#define _INTIE_REG_CWIE_LENGTH                              0x1
#define _INTIE_REG_CWIE_MASK                                0x40
#define _INTIE_REG_ADIE_POSN                                0x7
#define _INTIE_REG_ADIE_POSITION                            0x7
#define _INTIE_REG_ADIE_SIZE                                0x1
#define _INTIE_REG_ADIE_LENGTH                              0x1
#define _INTIE_REG_ADIE_MASK                                0x80

// Register: ISTATUS
#define ISTATUS ISTATUS
extern volatile unsigned char           ISTATUS             __at(0x066);
#ifndef _LIB_BUILD
asm("ISTATUS equ 066h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned C                      :1;
        unsigned DC                     :1;
        unsigned Z                      :1;
        unsigned nPD                    :1;
        unsigned nTO                    :1;
        unsigned PA0                    :1;
        unsigned PA1                    :1;
    };
} ISTATUSbits_t;
extern volatile ISTATUSbits_t ISTATUSbits __at(0x066);
// bitfield macros
#define _ISTATUS_C_POSN                                     0x0
#define _ISTATUS_C_POSITION                                 0x0
#define _ISTATUS_C_SIZE                                     0x1
#define _ISTATUS_C_LENGTH                                   0x1
#define _ISTATUS_C_MASK                                     0x1
#define _ISTATUS_DC_POSN                                    0x1
#define _ISTATUS_DC_POSITION                                0x1
#define _ISTATUS_DC_SIZE                                    0x1
#define _ISTATUS_DC_LENGTH                                  0x1
#define _ISTATUS_DC_MASK                                    0x2
#define _ISTATUS_Z_POSN                                     0x2
#define _ISTATUS_Z_POSITION                                 0x2
#define _ISTATUS_Z_SIZE                                     0x1
#define _ISTATUS_Z_LENGTH                                   0x1
#define _ISTATUS_Z_MASK                                     0x4
#define _ISTATUS_nPD_POSN                                   0x3
#define _ISTATUS_nPD_POSITION                               0x3
#define _ISTATUS_nPD_SIZE                                   0x1
#define _ISTATUS_nPD_LENGTH                                 0x1
#define _ISTATUS_nPD_MASK                                   0x8
#define _ISTATUS_nTO_POSN                                   0x4
#define _ISTATUS_nTO_POSITION                               0x4
#define _ISTATUS_nTO_SIZE                                   0x1
#define _ISTATUS_nTO_LENGTH                                 0x1
#define _ISTATUS_nTO_MASK                                   0x10
#define _ISTATUS_PA0_POSN                                   0x5
#define _ISTATUS_PA0_POSITION                               0x5
#define _ISTATUS_PA0_SIZE                                   0x1
#define _ISTATUS_PA0_LENGTH                                 0x1
#define _ISTATUS_PA0_MASK                                   0x20
#define _ISTATUS_PA1_POSN                                   0x6
#define _ISTATUS_PA1_POSITION                               0x6
#define _ISTATUS_PA1_SIZE                                   0x1
#define _ISTATUS_PA1_LENGTH                                 0x1
#define _ISTATUS_PA1_MASK                                   0x40

// Register: IFSR
#define IFSR IFSR
extern volatile unsigned char           IFSR                __at(0x067);
#ifndef _LIB_BUILD
asm("IFSR equ 067h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned IFSR                   :7;
    };
} IFSRbits_t;
